OpenNuvoton/M2351BSP/SampleCode/CardReader/USBD_CCID/sc_intf.c
    return SLOT_NO_ERROR;
}



/**
  * @brief  This function does nothing
  * @param  intf Indicate which interface to open, ether 0 or 1
  * @param  pu8CmdBuf Command Data
  * @param  pu32CmdSize The size of command data
  * @return Slot Status Error Code
  */
uint8_t Intf_Escape(int32_t intf,
                    uint8_t *pBlockBuffer,
                    uint32_t *pBlockSize)
{
    if(intf != 0 && intf != 1 && intf != 2)
        return SLOTERR_BAD_SLOT;

    *pBlockSize = 128;

    return SLOT_NO_ERROR;
}



/**
  * @brief  Enable/Disable Clock
  * @param  intf Indicate which interface to open, ether 0 or 1
  * @param  u32Cmd Specify to enable/disable clock
  * @return Slot Status Error Code
  */
uint8_t Intf_SetClock(int32_t intf, uint8_t u32Cmd)
{
    SC_T *pSC;

    if((__PC()&NS_OFFSET) == NS_OFFSET)
        pSC = (intf == 0) ? SC0_NS : (intf == 1) ? SC1_NS : SC2_NS;
    else
        pSC = (intf == 0) ? SC0 : (intf == 1) ? SC1 : SC2;

    if(intf != 0 && intf != 1 && intf != 2)
        return SLOTERR_BAD_SLOT;

    if(SC_IsCardInserted(pSC) == TRUE)
        return SLOTERR_ICC_MUTE;

    // Do nothing.

    return SLOT_NO_ERROR;
}



/**
  * @brief  Get card slot status
  * @param  intf Indicate which interface to open
  * @return Slot status error code
  */
uint8_t Intf_GetSlotStatus(int32_t intf)
{
    uint8_t Ret = 0x00;
    SC_T *pSC;

    if((__PC()&NS_OFFSET) == NS_OFFSET)
        pSC = (intf == 0) ? SC0_NS : (intf == 1) ? SC1_NS : SC2_NS;
    else
        pSC = (intf == 0) ? SC0 : (intf == 1) ? SC1 : SC2;

    if(intf != 0 && intf != 1 && intf != 2)
        return SLOTERR_BAD_SLOT;

    if(SC_IsCardInserted(pSC) == TRUE)
    {
        if(pSC->PINCTL & SC_PINCTL_CLKKEEP_Msk)
        {
            Ret = 0x00;
            CCIDSCDEBUG("Intf_GetSlotStatus:: Running ... \n");
        }
        else
        {
            Ret = 0x01;
            CCIDSCDEBUG("Intf_GetSlotStatus:: Stop ... \n");
        }
    }
    else
    {
        Ret = 0x02;
        CCIDSCDEBUG("Intf_GetSlotStatus:: Card absent ... \n");
    }

    return Ret;
}


/**
  * @brief  Get clock status of card slot
  * @param  intf Indicate which interface to open
  * @return Slot status error code
  */
uint8_t Intf_GetClockStatus(int32_t intf)
{
    SC_T *pSC;

    if((__PC()&NS_OFFSET) == NS_OFFSET)
        pSC = (intf == 0) ? SC0_NS : (intf == 1) ? SC1_NS : SC2_NS;
    else
        pSC = (intf == 0) ? SC0 : (intf == 1) ? SC1 : SC2;

    if(intf != 0 && intf != 1 && intf != 2)
        return SLOTERR_BAD_SLOT;

    if(pSC->PINCTL & SC_PINCTL_CLKKEEP_Msk)        // clock running
        return 0x00;
    else // clock stopped LOW
        return 0x01;

}

/**
  * @brief  Abort all transmitting or receiving process
  * @param  intf Indicate which interface to open, ether 0 or 1
  * @return Slot status error code
  */
uint8_t Intf_AbortTxRx(int32_t intf)
{
    SC_T *pSC;

    if((__PC()&NS_OFFSET) == NS_OFFSET)
        pSC = (intf == 0) ? SC0_NS : (intf == 1) ? SC1_NS : SC2_NS;
    else
        pSC = (intf == 0) ? SC0 : (intf == 1) ? SC1 : SC2;

    if(intf != 0 && intf != 1 && intf != 2)
        return SLOTERR_BAD_SLOT;

    // disable Tx interrupt
    pSC->INTEN &= ~SC_INTEN_TBEIEN_Msk;

    // Tx/Rx software reset
    SC_ClearFIFO(pSC);

    return SLOT_NO_ERROR;

}

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
